let input = prompt("لطفا مصراع یا بیت مدنظر خود را وارد نمایید : ");
export  function poetry(input){
let abyat =
        {
            'ب':
                {
                    1: 'با خدا باش و پادشاهي کن        بي خدا باش و هر چه خواهي کن'
                },
            'د':
                {
                    1: 'دلي كز معرفت نور و صفا ديد        به هر چيزي كه ديد اول خدا ديد'
                },
            'ت':
                {
                    1: 'تا شدم حلقه به گوش در میخانه عشق                   هر دم آید غمی از نو به مبارک بادم'
                },
            'ر':
                {
                    1: 'روزهـــا گــر رفـــت گــو رو باك نیســــت                       تو بمان ای آنكه چون تو پاك نیست'
                },
            'ج':
                {
                    1: 'جـمالــت آفتـــــاب هر نــظر بــــاد                  ز خـوبــــی روی خوبــت خوبـتــر بـاد'
                },
            'س':
                {
                    1: 'سرو چمان من چرا میل چمن نمیکند                         همدم گل نمیشود یاد سمن نمیکند'
                },
            'ش':
                {
                    1: 'شاه شمشاد قدان خسرو شیرین دهنان                          که به مژگان شکند فلب همه صف شکنان'
                },
            'ن':
                {
                    1: 'نفس باد صبا مشک فشان خواهد شد                            عالم پیر دگر باره جوان خواهد شد'
                },
            'م':
                {
                    1: 'ما زخـــود سوی تو گردانیم ســــر                     چون تـــویی از ما به ما نزدیکتــــر'
                },
            'ه':
                {
                    1: 'هرگز نمیرد آنکه دلش زنده شد به عشق                         ثبــت اســت بر جریــده عالــم دوام مــا'
                },
            }
    let result ;
    result = input.slice(-1);
    let beyt = abyat[result];
return beyt[1];
}
    console.log(poetry(input));

